# KeepReadable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..KeepReadable Property
ParameterTypeId Class See Also
---
"Keep Readable"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId KeepReadable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KeepReadable As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KeepReadable {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace